In [1]:
import pandas as pd
import numpy as np

In [4]:
train = pd.read_csv('./Air_toxicity/train.csv')

In [5]:
train.head()

        ID State.Name  Year    Age    Incidence
0  f8312a4    Alabama  1990  65-69  4685.284313
1  3effa36    Alabama  1990  70-74  4827.052043
2  1e8044b    Alabama  1990  75-79  4377.956914
3  d875d65    Alabama  1990  80-84  3822.732993
4  46e6695    Alabama  1990  85-89  3470.199503

In [6]:
test = pd.read_csv('./Air_toxicity/test.csv')

In [7]:
test.head()

        ID State.Name  Year    Age
0  6c06615   Delaware  1990  65-69
1  e0cf76e   Delaware  1990  70-74
2  e9f95f0   Delaware  1990  75-79
3  5dffe44   Delaware  1990  80-84
4  9f9ea9b   Delaware  1990  85-89

In [8]:
train.isnull().sum()

ID            0
State.Name    0
Year          0
Age           0
Incidence     0
dtype: int64

In [9]:
train['Age'].value_counts()

65-69    750
70-74    750
75-79    750
80-84    750
85-89    750
90-94    750
Name: Age, dtype: int64

In [12]:
train['Year'].value_counts(ascending=True)

1990    150
2017    150
2016    150
2015    150
2014    150
2013    150
2012    150
2011    150
2010    150
2009    150
2008    150
2007    150
2006    150
2005    150
2004    150
2003    150
2002    150
2001    150
2000    150
1999    150
1998    150
1997    150
1996    150
1995    150
1994    150
1993    150
1992    150
1991    150
2018    150
2019    150
Name: Year, dtype: int64

In [13]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          4500 non-null   object
 1   State.Name  4500 non-null   object
 2   Year        4500 non-null   int64
 3   Age         4500 non-null   object
 4   Incidence   4500 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 175.9+ KB

In [14]:
train['State.Name'].value_counts()

Alabama                 180
Iowa                    180
Texas                   180
Tennessee               180
Oregon                  180
Oklahoma                180
Ohio                    180
North Dakota            180
North Carolina          180
Montana                 180
Mississippi             180
Michigan                180
Indiana                 180
Alaska                  180
Idaho                   180
Hawaii                  180
Georgia                 180
Florida                 180
District of Columbia    180
Connecticut             180
Colorado                180
California              180
Arkansas                180
Arizona                 180
Washington              180
Name: State.Name, dtype: int64

In [15]:
haps = pd.read_parquet('./Air_toxicity/supplementary_HAPS.parquet', engine='pyarrow')

In [16]:
haps.head()

  State.Name  Date.Local     Parameter.Name  Arithmetic.Mean  X1st.Max.Value
0    Alabama  1980-01-04  Arsenic (TSP) STP              0.0             0.0
1    Alabama  1980-01-16  Arsenic (TSP) STP              0.0             0.0
2    Alabama  1980-01-28  Arsenic (TSP) STP              0.0             0.0
3    Alabama  1980-02-09  Arsenic (TSP) STP              0.0             0.0
4    Alabama  1980-02-21  Arsenic (TSP) STP              0.0             0.0

In [17]:
haps.shape

(9834368, 5)

In [18]:
lead = pd.read_parquet('./Air_toxicity/supplementary_LEAD.parquet', engine='pyarrow')
lead.head()

  State.Name  Date.Local  Parameter.Name  Arithmetic.Mean  X1st.Max.Value
0    Alabama  1980-01-04  Lead (TSP) STP             0.04            0.04
1    Alabama  1980-01-16  Lead (TSP) STP             0.26            0.26
2    Alabama  1980-01-28  Lead (TSP) STP             0.13            0.13
3    Alabama  1980-02-09  Lead (TSP) STP             0.11            0.11
4    Alabama  1980-02-21  Lead (TSP) STP             0.10            0.10

In [19]:
lead.shape

(866835, 5)

In [20]:
no = pd.read_parquet('./Air_toxicity/supplementary_NONOxNOy.parquet', engine='pyarrow')

In [21]:
no.head()

  State.Name  Date.Local     Parameter.Name  Arithmetic.Mean  X1st.Max.Value
0    Alabama  1980-01-01  Nitric oxide (NO)        54.458333           275.0
1    Alabama  1980-01-02  Nitric oxide (NO)       130.545455           279.0
2    Alabama  1980-01-03  Nitric oxide (NO)       122.333333           421.0
3    Alabama  1980-01-04  Nitric oxide (NO)         5.600000            12.0
4    Alabama  1980-01-05  Nitric oxide (NO)         6.166667            13.0

In [22]:
vocs = pd.read_parquet('./Air_toxicity/supplementary_VOCS.parquet', engine='pyarrow')

In [23]:
vocs.head()

,State.Name,Date.Local,Parameter.Name,Arithmetic.Mean,X1st.Max.Value
0,Alabama,1980-01-01,Total NMOC (non-methane organic compound),627.083333,2020.0
1,Alabama,1980-01-02,Total NMOC (non-methane organic compound),1240.909091,3360.0
2,Alabama,1980-01-03,Total NMOC (non-methane organic compound),2079.166667,5670.0
3,Alabama,1980-01-04,Total NMOC (non-methane organic compound),925.833333,3110.0
4,Alabama,1980-01-05,Total NMOC (non-methane organic compound),170.833333,1250.0

In [24]:
vocs.shape

(26601135, 5)